#ifndef F1_GPIO_H_                // Блокируем повторное включение этого модуля
#define F1_GPIO_H_

//******************************************************************************
//  Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************

#include "conf.h"

//******************************************************************************
//  Секция определения констант
//******************************************************************************



//******************************************************************************
//  Секция определения типов
//******************************************************************************

typedef struct
{
    GPIO_TypeDef 	 *gpio;
    uint16_t 		  Pin;
    uint32_t          Mode;
    uint32_t          Pull;
    uint32_t          Speed;
} gpio_config_t;

//******************************************************************************
//  Секция определения глобальных переменных
//******************************************************************************



//******************************************************************************
//  Секция прототипов глобальных функций
//******************************************************************************

void gpioInit(const gpio_config_t * cfg, uint8_t num);

void gpioClockEnable(GPIO_TypeDef  *GPIOx);

void gpioHi(uint8_t gpio_id);
void gpioLo(uint8_t gpio_id);
void gpioToggle(uint8_t gpio_id);

//******************************************************************************
//  Секция определения макросов
//******************************************************************************

#endif                       // Закрывающий #endif к блокировке повторного включения

//******************************************************************************
//  ENF OF FILE
//******************************************************************************

