#ifndef TEMPLATE_H_                // Блокируем повторное включение этого модуля
#define TEMPLATE_H_

//******************************************************************************
//  Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************

#include "conf.h"

//******************************************************************************
//  Секция определения констант
//******************************************************************************



//******************************************************************************
//  Секция определения типов
//******************************************************************************

typedef struct
{
	I2C_TypeDef  	   *regs;				/* I2C port */
	GPIO_TypeDef 	   *scl_gpio_port;
	uint16_t			scl_gpio_pin;
	GPIO_TypeDef 	   *sda_gpio_port;
	uint16_t			sda_gpio_pin;
	uint32_t			ClkSpeed;
} i2c_cfg_t;

//******************************************************************************
//  Секция определения глобальных переменных
//******************************************************************************



//******************************************************************************
//  Секция прототипов глобальных функций
//******************************************************************************

void i2cClockEnable(I2C_TypeDef  *I2Cx);
int32_t i2cInit(uint8_t i2c_id);
void i2cConfig(const i2c_cfg_t * cfg, uint8_t num);
uint8_t i2cRead(uint8_t Addr, uint8_t Reg, uint8_t len, uint8_t* Data);
uint8_t i2cWrite(uint16_t Addr, uint8_t Reg, uint8_t Data);

//******************************************************************************
//  Секция определения макросов
//******************************************************************************

#endif                       // Закрывающий #endif к блокировке повторного включения

//******************************************************************************
//  ENF OF FILE
//******************************************************************************

