/*
 * motor.h
 *
 *  Created on: 12 сент. 2018 г.
 *      Author: Sergey
 */

#ifndef MOTOR_H_
#define MOTOR_H_

//******************************************************************************
//  Секция include
//******************************************************************************

#include "conf.h"


//******************************************************************************
//  Секция определения констант
//******************************************************************************

enum         // Направление вращения мотора
{
	STOP = 0,
	BACKWARD = 0,
	FORWARD
};

#define MOTOR_LEFT_DIR(dir)       {HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, dir);}
#define MOTOR_RIGHT_DIR(dir)      {HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, dir);}
#define MOTOR_LEFT_SPEED(speed)   {HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, speed);}
#define MOTOR_RIGHT_SPEED(speed)  {HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, speed);}

//******************************************************************************
//  Секция определения типов
//******************************************************************************


//******************************************************************************
//  Секция определения глобальных переменных
//******************************************************************************

extern int direction;

//******************************************************************************
//  Секция прототипов глобальных функций
//******************************************************************************

void MotorCtrlDrive(float speed);

//******************************************************************************
//  Секция определения макросов
//******************************************************************************

#endif                   // Закрывающий #endif к блокировке повторного включения

//******************************************************************************
//  ENF OF FILE
//******************************************************************************
